export const articleTitle = 'Як використовувати оператори and та | в XPath';

export const articleThesis =
  ' У чому різниця між операторами and та | в XPath і як правильно їх використовувати.';

export const articleBody =
  "В XPath оператори and та | використовуються для різних цілей при виборі елементів у HTML-документі. Оператор and поєднує кілька умов, які повинні бути виконані одночасно для одного елемента, наприклад, вибираючи <a> елемент із певним класом і текстом. У той же час, оператор | об’єднує результати кількох окремих селекторів, повертаючи елементи, що відповідають будь-якому з них, що дозволяє створювати гнучкіші пошукові запити. Наприклад, //a[@class=''nav-link''] | //h1[contains(text(), ''Sign in '')] знайде всі <a> елементи з класом ''nav - link'' і <h1> з текстом ''Sign in ''. Вибір правильного оператора дозволяє ефективно працювати з документами та знаходити потрібні елементи навіть у складній структурі HTML.";

export const articleTags = 'XPath, Locators';
